"""

import numpy as np
n, m = map(int, input().split())

M = [[0 for _ in range(m + 2)] for _ in range(n + 2)]

for i in range(m + 2):
    M[0][i] = 1
    M[1][i] = 1

for i in range(n + 2):
    M[i][0] = 1
    M[i][1] = 1

# Маска
MASK = [
    [0, 1, 1],
    [1, 0, 1],
    [1, 1, 0]
]

for i in range(2, n + 2):
    for j in range(2, i + 1):
        num = 0
        for di in range(3):
            for dj in range(3):
                if MASK[di][dj] == 1:
                    num += M[i - 2 + di][j - 2 + dj]
        if num == 6:
            M[i][j] = 0
            M[j][i] = 0
        else:
            M[i][j] = 1
            M[j][i] = 1

np.set_printoptions(threshold=np.inf)            
print(np.array(M))
if M[n + 1][m + 1] == 0:
    print('Lose')
else:
    print('Win')

out:
20 20
[[1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1]
 [1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1]
 [1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1]
 [1 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0]
 [1 1 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1]
 [1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1]
 [1 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0]
 [1 1 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1]
 [1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1]
 [1 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0]
 [1 1 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1]
 [1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1]
 [1 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0]
 [1 1 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1]
 [1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1]
 [1 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0]
 [1 1 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1]
 [1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1]
 [1 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0]
 [1 1 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1]
 [1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1]
 [1 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0 1 1 0]]
Lose

Виден период, результат выполнения доказывает как индукцию, так и индукционный переход

"""

n, m = map(int, input().split(' '))

MASK = [[0, 1, 1],
        [1, 0, 1],
        [1, 1, 0]]
i = n % 3
j = m % 3

if MASK[i][j] == 1:
    print('Win')
else:
    print('Lose')
